In [1]:
import numpy as np
from pandas import DataFrame,Series
import pandas as pd

In [3]:
df1=pd.read_csv('anye.csv')
df1

   1  4  5 Etim
0  7  8  4  Udo
1  5  6  4  Umo

In [4]:
pd.read_table('anye.csv',sep=',' )

   1  4  5 Etim
0  7  8  4  Udo
1  5  6  4  Umo

In [6]:
df2=pd.read_csv('anye.csv',header=None)
df2

   0  1  2     3
0  1  4  5  Etim
1  7  8  4   Udo
2  5  6  4   Umo

In [7]:
df2.columns=['Age','Utom','Udua','Anying']
df2

   Age  Utom  Udua Anying
0    1     4     5   Etim
1    7     8     4    Udo
2    5     6     4    Umo

In [9]:
df2.index=np.arange(3)
df2

   Age  Utom  Udua Anying
0    1     4     5   Etim
1    7     8     4    Udo
2    5     6     4    Umo

In [10]:
df2.index=['A','B','D']

In [11]:
df2

   Age  Utom  Udua Anying
A    1     4     5   Etim
B    7     8     4    Udo
D    5     6     4    Umo

In [13]:
pd.read_csv('anye.csv',nrows=2)

   1  4  5 Etim
0  7  8  4  Udo
1  5  6  4  Umo

In [14]:
df1

   1  4  5 Etim
0  7  8  4  Udo
1  5  6  4  Umo

In [15]:
df1.to_csv('afo.csv',sep=',')

In [16]:
df1.to_csv('ami.csv',sep='@')

In [18]:
df3=pd.read_csv('ami.csv')
df3

   @1@4@5@Etim
0  0@7@8@4@Udo
1  1@5@6@4@Umo

In [26]:
import sys

In [27]:
df2.to_csv(sys.stdout,sep='?')

?Age?Utom?Udua?Anying
A?1?4?5?Etim
B?7?8?4?Udo
D?5?6?4?Umo